In [157]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

import pandas as pd
df = pd.DataFrame(people)

In [158]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [159]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [160]:
df.columns = ['first_name', 'last_name', 'email']

In [161]:
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [162]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [163]:
df.columns = [x.lower() for x in df.columns]
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [164]:
df.columns = df.columns.str.replace(' ','_')
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [165]:
df.rename(columns={'first_name': 'first', 'last_name': 'last'} , inplace=True)

In [166]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [167]:
#7:00 TS
df.loc[2] = ['John', 'Smith', 'JohnSmith@email.com']

In [168]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith      JohnSmith@email.com

In [169]:
#7:53 TS
df.loc[2, ['last', 'email']] = ['Doe', 'JohnDoe@email.com']

In [170]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [171]:
df.loc[2, 'last'] = 'Smith' #9:25 TS

In [172]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@email.com

In [173]:
df.at[2, 'last'] = 'Doe'

In [174]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [175]:
#11:25 TS
filt = (df['email'] == 'JohnDoe@email.com')
df[filt]

  first last              email
2  John  Doe  JohnDoe@email.com

In [176]:
df[filt]['last']  = 'Smith'

C:\Users\samsh\AppData\Local\Temp\ipykernel_22280\3320397023.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]['last']  = 'Smith'

In [177]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [178]:
df.loc[filt, 'last'] = 'Smith'

In [179]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@email.com

In [180]:
#15:35 TS
#Update Multiple Rows

df['email'] = df['email'].str.lower()
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [181]:
##################################Functions on Series #######################################
#we can convert a series of column via below methods
'''
apply --wors on Series and DF
map
applymap
replace
'''

'\napply --wors on Series and DF\nmap\napplymap\nreplace\n'

In [182]:
#this is how apply work on a series. Apply works for every values of series
#Usage series.apply(function)

df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [183]:
def update_email(email):
    return email.upper()

In [184]:
df['email'].apply(update_email)

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@EMAIL.COM
2          JOHNDOE@EMAIL.COM
Name: email, dtype: object

In [185]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [186]:
df['email'] = df['email'].apply(update_email)

In [187]:
df

   first     last                    email
0  Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1   Jane      Doe        JANEDOE@EMAIL.COM
2   John    Smith        JOHNDOE@EMAIL.COM

In [188]:
#21:13 TS
df['email'] = df['email'].apply(lambda x : x.lower())
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [205]:
#22.20
##################################Functions on DataFrame #######################################
#Apply works on DataFrame

In [190]:
#Apply on Series
df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [191]:
#Apply on Dataframe
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [192]:
len(df['email'])

3

In [193]:
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [194]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [206]:
#df.apply(min)
df.apply(pd.Series.min)

#df.apply(min,axis='columns')
#df.apply(pd.Series.min,axis='columns')

first                      Chris
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [196]:
df.apply(lambda x: x.min())

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [197]:
#28:00
#df.applymap(len) #Deprecated
#C:\Users\samsh\AppData\Local\Temp\ipykernel_22280\451406203.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.

df.map(len)

   first  last  email
0      5     7     23
1      4     3     17
2      4     5     17

In [198]:
#df.applymap(str.lower) #Deprecated
df.map(str.lower)

   first     last                    email
0  corey  schafer  coreymschafer@gmail.com
1   jane      doe        janedoe@email.com
2   john    smith        johndoe@email.com

In [203]:
df

   first     last                    email
0  Chris  Schafer  coreymschafer@gmail.com
1   Mary      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [200]:
#Map works on Series 
df['first'].map({'Corey': 'Chris', 'Jane': 'Mary'})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [201]:
df['first'] = df['first'].replace({'Corey': 'Chris', 'Jane': 'Mary'})

In [202]:
df

   first     last                    email
0  Chris  Schafer  coreymschafer@gmail.com
1   Mary      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com